IDENTIFICATION DIVISION.
PROGRAM-ID. ARREGLO.
AUTHOR HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 24/11/19.
DATE-COMPILED 24/11/19.
SECURITY. NO ES CONFIDENCIAL.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.



PROCEDURE DIVISION.
 
STOP RUN.