IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULAR.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 30/11/19.
DATE-COMPILED 30/11/19.
SECURITY. NO ES CONFIDENCIAL.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 FINAL-DE-SESION PIC X VALUE "N".
77 MONTO-VENTA PIC 9(5)V99.
77 IMPUESTO PIC Z,ZZZ.99.


PROCEDURE DIVISION.
 
 BEGIN.
  DISPLAY "--"
  PERFORM PARRAFO UNTIL FINAL-DE-SESION = "Y" OR FINAL-DE-SESION = "y".
  DISPLAY "FINAL DE SESION".

 PARRAFO.
  ADD 100 TO MONTO-VENTA
  COMPUTE IMPUESTO = MONTO-VENTA*0.02
  DISPLAY "MONTO:"MONTO-VENTA
  DISPLAY "IMPUESTO:"IMPUESTO
  DISPLAY "DESEAS SALIR?"
  ACCEPT FINAL-DE-SESION
  IF FINAL-DE-SESION = "Y" OR FINAL-DE-SESION="y" THEN
    DISPLAY "HAS SALIDO: "FINAL-DE-SESION
    EXIT
  END-IF
  *> GO TO BEGIN

STOP "PAUSE".
STOP RUN.