IDENTIFICATION DIVISION.
PROGRAM-ID. CICLO.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 19/11/19.
DATE-COMPILED 19/11/19.
SECURITY. NO ES CONFIDENCIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO PIC 9(2) VALUE 0.

PROCEDURE DIVISION.
 PERFORM CONTAR 10 TIMES
STOP RUN.

CONTAR.
  ADD 1 TO NUMERO
  DISPLAY NUMERO.
