IDENTIFICATION DIVISION.
PROGRAM-ID. DECIDEGOTO.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 30/11/19.
DATE-COMPILED 30/11/19.
SECURITY. NO ES CONFIDENCIAL.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATO.
  02 NUMERO PIC 9(3) VALUE ZEROES.
  02 CADENA PIC A(10) VALUE SPACES.


PROCEDURE DIVISION.
 


STOP RUN.