IDENTIFICATION DIVISION.
PROGRAM-ID. DECIDEGOTO.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 30/11/19.
DATE-COMPILED 30/11/19.
SECURITY. NO ES CONFIDENCIAL.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATO.
  02 NUMERO PIC 9(3) VALUE ZEROES.
  02 CADENA PIC A(10) VALUE SPACES.


PROCEDURE DIVISION.
 
 BEGIN.
 IF NUMERO IS NUMERIC THEN
   GO TO PARRAFO1
 END-IF.
 
 IF CADENA IS ALPHABETIC THEN
   GO TO PARRAFO2
 END-IF.


 PARRAFO1.
   DISPLAY "PARRAFO 1".

 PARRAFO2.
   DISPLAY "PARRAFO 2".


STOP RUN.