IDENTIFICATION DIVISION.
PROGRAM-ID. DECIDE.
AUTHOR HIRONAKAMURA.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 16/11/19.
DATE-COMPILED. 16/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 Cliente.
  02 ClienteId PIC 9(8) VALUE ZEROS.
  02 ClienteNombre.
    03 Iniciales PIC X(4) VALUE SPACES.
    03 Nombre  PIC X(30) VALUE SPACES.
  02 Genero PIC X VALUE SPACES.
  02 Pago PIC 9(5)V99 VALUE ZEROS.


PROCEDURE DIVISION.
 PERFORM DECISION
STOP RUN.

DECISION.
 DISPLAY "*****************".
 DISPLAY "**** CLIENTE ****".
 DISPLAY "*****************".
 *> ASIGNAR VALORES
 MOVE 65073411 TO ClienteId.
 MOVE "JPGJ" TO Iniciales.
 MOVE "JUAN POLINAR GARCIA JUAREZ" TO Nombre.
 MOVE "M" TO Genero.
 MOVE 25000 TO Pago.
 *> AQUI VEMOS TODO
 DISPLAY "["Cliente"]".
 DISPLAY "Cliente no. "ClienteId.
 DISPLAY "Nombre del cliente: "Nombre" [ "Iniciales" ] - "Genero.
 DISPLAY "Pago $"Pago.
 EVALUATE Genero
    WHEN "M" DISPLAY "SOLO SE APLICA EL PORCENTAJE A MUJERES"
    WHEN "F" DISPLAY "BIENVENIDA AL SISTEMA DE DESCUENTO"
 END-EVALUATE.

 EVALUATE Pago
    WHEN 20000 DISPLAY "APLICA EL DESCUENTO EN AREA DE COMIDA"
    WHEN 24000 DISPLAY "AUN APLICA EL DESCUENTO EN AREA DE COMIDA" 
    WHEN 25000 DISPLAY "NO APLICA EL DESCUENTO EN AREA DE COMIDA" 
 END-EVALUATE.


