IDENTIFICATION DIVISION.
PROGRAM-ID. ECONOMICA.
AUTHOR HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 24/11/19.
DATE-COMPILED 24/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Economica.
  02 Presente PIC 9(4)V99.
  02 Interes PIC 9(4)V99.
  02 Periodo PIC 9(2).
  02 Futuro PIC 9(4)V99.


PROCEDURE DIVISION.
 DISPLAY "******ECONOMICA******".
 DISPLAY "Introduce valor presente:".
 ACCEPT Presente.
 DISPLAY "Introduce tasa de interes:"
 ACCEPT Interes.
 DISPLAY "Introduce periodo:".
 ACCEPT Periodo.
 DISPLAY "Datos:".
 DISPLAY "CANTIDAD $"Presente.
 DISPLAY "TASA DE INTERES DEL "Interes"%".
 DISPLAY "CON UN PERIODO DE "Periodo" MESES DE PAGO".
 COMPUTE Futuro = Presente * ((1+Interes) ** PERIODO).
 DISPLAY "CANTIDAD FUTURA $"Futuro.
 DISPLAY "****RESULTADO***".
 DISPLAY Economica.
STOP RUN.
