IDENTIFICATION DIVISION.
PROGRAM-ID. ECONOMICA-THREE.
AUTHOR HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 24/11/19.
DATE-COMPILED 24/11/19.
SECURITY. NO ES CONFIDENCIAL.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Economica.
  02 Presente PIC 9(4)V99.
  02 Interes PIC 9(4)V99.
  02 Periodo PIC 9(2).
  02 Futuro PIC 9(4)V99.


PROCEDURE DIVISION.
 DISPLAY "******ECONOMICA******".
 SET Presente TO 5000.32
 SET Interes TO 0.012
 SET Periodo TO 10
 DISPLAY "CANTIDAD INICIAL $"Presente
 DISPLAY "TASA DE INTERES "Interes"%"
 DISPLAY "PERIODO "Periodo.
 DISPLAY "VALOR FUTURO:"
 PERFORM Periodo TIMES
    ADD 1 TO Periodo
    COMPUTE Futuro = Presente * ((1+Interes) ** Periodo)
    DISPLAY "$"Futuro
 END-PERFORM
 DISPLAY "CANTIDAD FINAL $"Futuro.
STOP RUN.