IDENTIFICATION DIVISION.
PROGRAM-ID. EDAD.
AUTHOR FERNANDO CARRARO.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 16/11/19.
DATE-COMPILED.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-EDAD PIC 9(2).


PROCEDURE DIVISION.
 PERFORM DECISION.
STOP RUN.


DECISION.
  DISPLAY "INTRODUCE TU EDAD:"
  ACCEPT WS-EDAD
  DISPLAY "TIENES "WS-EDAD" AÑOS DE EDAD"

  IF WS-EDAD >= 18 THEN
      DISPLAY "ESTAS EN EDAD PARA VOTAR"
   ELSE
      DISPLAY "AUN NO PUEDES VOTAR"
  END-IF.

