IDENTIFICATION DIVISION.
PROGRAM-ID. CICLO.
AUTHOR HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 19/11/19.
DATE-COMPILED 19/11/19.
SECURITY. NO ES CONFIDENCIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
 SET NUMERO TO 100
 DISPLAY "Numero:"NUMERO
 EVALUATE NUMERO
   WHEN 100 THRU 200
     DISPLAY "DE 100 A 200"
   WHEN 250 THRU 300
     DISPLAY "DE 250 A 300"
   WHEN 310 THRU 350
     DISPLAY "DE 310 A 350"
   WHEN OTHER
     DISPLAY "NINGUNO"
 END-EVALUATE.
STOP RUN.
