IDENTIFICATION DIVISION.
PROGRAM-ID. ATRAVES.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 23/11/19.
DATE-COMPILED 23/11/19.
SECURITY. NO ES CONFIDENCIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NOMBRE PIC X(12).
01 APELLIDO PIC X(12).

PROCEDURE DIVISION.
  PERFORM PIDENOMBRE THRU MOSTRAR 1 TIMES
STOP RUN.

PIDENOMBRE.
    DISPLAY "DAME TU NOMBRE:".
    ACCEPT NOMBRE.
    DISPLAY "DAME TUS APELLIDOS:".
    ACCEPT APELLIDO.

MOSTRAR.
    DISPLAY "HOLA "NOMBRE,APELLIDO.
    