IDENTIFICATION DIVISION.
PROGRAM-ID. HASTA.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 23/11/19.
DATE-COMPILED 23/11/19.
SECURITY. NO ES CONFIDENCIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO PIC 9(2) VALUE 0.

PROCEDURE DIVISION.
 DISPLAY "UN 'WHILE' EN COBOL:"
 PERFORM UNTIL NUMERO = 99
        ADD 1 TO NUMERO
        DISPLAY "HOLA NO. : ", NUMERO
 END-PERFORM
STOP RUN.

