IDENTIFICATION DIVISION.
PROGRAM-ID. IF-THEN-CASOS.
AUTHOR. HIRONAKAMURA.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 05/01/20.
DATE-COMPILED. 05/01/20.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 RESULTADO PIC A(50).
01 X PIC 9(3).
01 Y PIC 9(3).


PROCEDURE DIVISION.

PROGRAM-BEGIN.
 PERFORM DATOS.
 PERFORM DECISION.
 PERFORM MOSTRAR.

PROGRAM-DONE.
 STOP RUN.

DATOS.
  DISPLAY "INTRODUCE PRIMER NUMERO:".
  ACCEPT X.
  DISPLAY "INTRODUCE SEGUNDO NUMERO:".
  ACCEPT Y.

DECISION.
  DISPLAY "CALCULANDO...".

  IF X > Y THEN
    MOVE "EL PRIMER NUMERO ES MAYOR AL SEGUNDO" TO RESULTADO
  ELSE
    MOVE "EL SEGUNDO NUMERO ES MAYOR AL PRIMERO" TO RESULTADO
  END-IF.


MOSTRAR.
  DISPLAY RESULTADO.

