IDENTIFICATION DIVISION.
PROGRAM-ID. IF-THEN-OPERA.
AUTHOR. HIRONAKAMURA.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 05/01/20.
DATE-COMPILED. 05/01/20.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO PIC 9(2).


PROCEDURE DIVISION.

PROGRAM-BEGIN.
 SET NUMERO TO 10.
 DISPLAY 
     "NUMERO = "
      NUMERO

 IF NUMERO = 10 THEN
    DISPLAY "EL NUMERO ES IGUAL A 10".

  MOVE 2 TO NUMERO.
  DISPLAY 
     "NUMERO = "
      NUMERO

 IF NUMERO < 10 THEN
    DISPLAY "EL NUMERO ES MENOR A 10".

 IF NUMERO > 0 AND NUMERO IS NUMERIC THEN
    DISPLAY "EL NUMERO ES MAYOR A CERO Y SI ES NUMERICO".

 MOVE 0 TO NUMERO.

 IF NUMERO > 0 OR NUMERO > -1 THEN
    DISPLAY "EL NUMERO ES IGUAL A CERO Y MAYOR A -1".

 IF NUMERO NOT GREATER THAN 0 THEN
    DISPLAY "EL NUMERO NO ES MAYOR A CERO".

 IF NUMERO LESS THAN -1 OR NUMERO LESS THAN 10 THEN
    DISPLAY "EL NUMERO ES MENOR A 10".

 
 MOVE 11 TO NUMERO.
 DISPLAY "EL NUMERO VALE "
         NUMERO

 IF NUMERO NOT GREATER THAN 13 AND NUMERO NOT LESS 10 THEN
    DISPLAY "NUMERO NO ES MAS GRANDE QUE 13 Y TAMPOCO MENOR A 10".

 IF NUMERO GREATER THAN 10 AND NUMERO IS NUMERIC AND NUMERO LESS THAN 33 THEN
    DISPLAY "NUMERO ES MAS GRANDE QUE 10, ES NUMERICO Y ES MENOR A 33".    
 

PROGRAM-DONE.
 STOP RUN.

