IDENTIFICATION DIVISION.
PROGRAM-ID. IF-THEN.
AUTHOR. HIRONAKAMURA.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 05/01/20.
DATE-COMPILED. 05/01/20.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 RESPUESTA PIC X.


PROCEDURE DIVISION.

PROGRAM-BEGIN.
 PERFORM DATOS.
 PERFORM MAYUSCULAS.
 PERFORM MOSTRAR.

PROGRAM-DONE.
 STOP RUN.

DATOS.
  DISPLAY "TE GUSTA LAS PELICULAS DE SUPER HEROES?".
  ACCEPT RESPUESTA.


MAYUSCULAS.
  IF RESPUESTA IS EQUAL "s" THEN
     MOVE "S" TO RESPUESTA.


MOSTRAR.
  DISPLAY
      "TU RESPUESTA FUE: "
      RESPUESTA.

      IF RESPUESTA IS EQUAL "S" THEN
          DISPLAY "DEBERIAS REDEFINIR TUS GUSTOS"
      ELSE
          DISPLAY "TU ERES DE LOS QUE TIENEN BUEN GUSTO"
      END-IF.




