IDENTIFICATION DIVISION.
PROGRAM-ID. CONVERSOR.
AUTHOR. ALQUIMISTA.
INSTALLATION. HIRONAKAMURA.
DATE-WRITTEN. 13/10/19.
DATE-COMPILED 27/10/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VALOR PIC 9(3) VALUE 20.
01 WS-RESULTADO PICTURE 9(3)V99 VALUE 0.0.
01 WS-OPC PIC X(9) VALUE "F".

PROCEDURE DIVISION.
 BEGIN.
 DISPLAY 'Menu: '.
 DISPLAY 'C. CELSIUS  F. FAHRENHEIT'.
 DISPLAY 'TU OPCION ES 'WS-OPC.
 
 
 IF WS-OPC = 'C' OR 'c' THEN
    COMPUTE WS-RESULTADO = (WS-VALOR - 32) * 0.55.
 
 IF WS-OPC = 'F' OR 'f' THEN
    COMPUTE WS-RESULTADO = (WS-VALOR * 1.8) + 32.
 
 DISPLAY 'RESULTADO = 'WS-RESULTADO.
    
 STOP RUN.
