IDENTIFICATION DIVISION.
PROGRAM-ID. MICUMPLE.
AUTHOR HIRONAKAMURA.
INSTALLATION. EN CUALQUIER PC.
DATE-WRITTEN. 15/11/19.
DATE-COMPILED.
SECURITY. NO ES CONFIDENCIAL.

*> AQUI DECLARO LAS VARIABLES
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 FechaDeNac.
      02 AnyoDeNac.
         03 Siglo PIC 99.
         03 Anyo  PIC 99.
      02 MesDeNac PIC 99.
      02 DiaDeNac PIC 99.
      
*> MAIN DEL PROGRAMA 
PROCEDURE DIVISION.
   MAIN.
   MOVE 19811218 TO FechaDeNac.
   DISPLAY "FECHA DE NACIMIENTO: "FechaDeNac.
   DISPLAY "MES: "MesDeNac.
   STOP-RUN.
