IDENTIFICATION DIVISION.
PROGRAM-ID. NOMBRE.
AUTHOR HIRONAKAMURA.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 17/11/19.
DATE-COMPILED. 17/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 Estudiante.
 02 EstudianteId PIC 9(8) VALUE 000000.
 02 EstudianteNombre.
   03 Iniciales PIC A(4) VALUE SPACES.
   03 Nombre PIC A(33) VALUE SPACES.
 02 Genero PIC A(1).
 02 Edad PIC 9(2) VALUE ZEROS.


PROCEDURE DIVISION.
 MOVE 67094 TO EstudianteId.
 MOVE "DSC" TO Iniciales.
 MOVE "DOMINGO SANCHEZ CORONA" TO Nombre.
 MOVE "M" TO Genero.
 MOVE 32 TO Edad.
 DISPLAY "[ "Estudiante" ]".
 SET Edad TO 33.
 DISPLAY "[ "Estudiante" ]".

EXIT PROGRAM.