IDENTIFICATION DIVISION.
PROGRAM-ID. NOMBRE.
AUTHOR HIRONAKAMURA.
INSTALLATION. CODEMONKEYJUNIOR.
DATE-WRITTEN. 17/11/19.
DATE-COMPILED. 17/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
77 WS-NOMBRE PIC A(15) VALUE "ARIEL".
77 WS-EDAD PIC 9(2) VALUE 33.
77 WS-CLAVE PIC X(34) VALUE "MX-234-90-A".


PROCEDURE DIVISION.
 DISPLAY "HOLA, "WS-NOMBRE.
 DISPLAY "TIENES "WS-EDAD" AÑOS DE EDAD".
 DISPLAY "TU CLAVE ES: "WS-CLAVE.
GOBACK.