IDENTIFICATION DIVISION.
PROGRAM-ID. PROG001.
AUTHOR HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 05/10/19.
DATE-COMPILED.
SECURITY. NO ES CONFIDENCIAL.

PROCEDURE DIVISION.
DISPLAY '****************************'.
DISPLAY '**  PROGRAMANDO EN COBOL  **'.
DISPLAY '                            '.
DISPLAY '       HOLA, MUNDO!!        '.
DISPLAY '****************************'.
STOP RUN.
