IDENTIFICATION DIVISION.
PROGRAM-ID. USO_DE_MOVE.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 16/11/19.
DATE-COMPILED 16/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 PRECIO PIC 9(4)V99.
01 NOMBRE PIC X(30) VALUE "MARIANA".


PROCEDURE DIVISION.
  PERFORM MOVIMIENTOS.
STOP RUN.

MOVIMIENTOS.
  DISPLAY "***USO DE MOVE EN COBOL ***".
  MOVE ZEROS TO PRECIO.
  DISPLAY "PRECIO = "PRECIO.
  MOVE 34.5 TO PRECIO.
  DISPLAY "PRECIO = "PRECIO.
  MOVE 123 TO PRECIO.
  DISPLAY "PRECIO = "PRECIO.
  MOVE 0.76 TO PRECIO.
  DISPLAY "PRECIO = "PRECIO.
  MOVE 1231 TO PRECIO.
  DISPLAY "PRECIO = "PRECIO.
  DISPLAY "NOMBRE (ORIGINAL): "NOMBRE.
  MOVE "LAURA" TO NOMBRE.
  DISPLAY "NOMBRE: "NOMBRE.
  MOVE "JULIA" TO NOMBRE.
  DISPLAY "NOMBRE: "NOMBRE.

