IDENTIFICATION DIVISION.
PROGRAM-ID. CONVERSOR.
AUTHOR. ALQUIMISTA.
INSTALLATION. HIRONAKAMURA.
DATE-WRITTEN. 30/11/19.
DATE-COMPILED 30/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.

 GO TO PARRAFO1.

 PARRAFO1.
  DISPLAY 'SOY EL PARRAFO1'.
  GO TO PARRAFO2.

 PARRAFO2.
  DISPLAY 'SOY EL PARRAFO2'.
  GO TO PARRAFO3.

 PARRAFO3.
  DISPLAY 'ESTE ES EL FINAL'. 
 
  
 STOP RUN.
