IDENTIFICATION DIVISION.
PROGRAM-ID. USO DE PERFORM.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 15/11/19.
DATE-COMPILED 15/11/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 SALUDO PIC X(38) VALUE
                  "HOLA, AMIGOS COBOLEROS".
PROCEDURE DIVISION.
   BEGIN.
   PERFORM VerMensaje 10 TIMES.
   STOP RUN.
   
 VerMensaje.
  DISPLAY ""SALUDO
