IDENTIFICATION DIVISION.
PROGRAM-ID. SUMA.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 12/10/19.
DATE-COMPILED 27/10/19.
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMX       PIC 9(10)     VALUE ZEROS.
01 WS-NUMY     PIC 9(10)     VALUE ZEROS.
01 WS-RESULT     PIC 99(10)    VALUE 0.
01 INTRODUCCION     PIC X(38) VALUE
                  "Por favor, introduce dos numeros".
PROCEDURE DIVISION.
CalculateResult.
   DISPLAY INTRODUCCION
   ACCEPT WS-NUMX
   ACCEPT WS-NUMY
   COMPUTE WS-RESULT = WS-NUMX + WS-NUMY
   DISPLAY "El resultado es = ", WS-RESULT
   STOP RUN.
