IDENTIFICATION DIVISION.
PROGRAM-ID. TIPOS.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
DATE-WRITTEN. 05/10/19.
DATE-COMPILED 27/10/19..
SECURITY. NO ES CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMERO PIC 9 VALUE 0. 
01 WS-STRING PIC X(21) VALUE "EN UN MUNDO CELESTIAL".
01 WS-RESULTADO PICTURE 9(3)V99 VALUE 0.0.
01  CARDINAL PIC 99 VALUE ZEROS.
01  ENTERO   PIC S99    VALUE -55.
01  DECIMAL  PIC 999V99 VALUE 893.32.
01  NOMBRE   PIC X(30)  VALUE SPACES.
01  REPORTE  PIC X(45)  VALUE "*** INFORME SOBRE CIEGOS ***".
01 WS-NUM1 PIC 99V9 VALUE IS 3.5.
01 WS-NAME PIC A(6) VALUE 'ABCD'.
01 WS-ID PIC 99 VALUE ZERO.
01 WS-ADDRESS.                                           
   05 WS-HOUSE-NUMBER    PIC 9(3).                    
   05 WS-STREET          PIC X(15).                    
   05 WS-CITY            PIC X(15).                    
   05 WS-COUNTRY         PIC X(15)  VALUE 'INDIA'.


PROCEDURE DIVISION.
DISPLAY '******************************'.
DISPLAY '***  PROGRAMANDO EN COBOL  ***'.
DISPLAY '                            '.
DISPLAY '       TIPOS DE DATOS        '.
DISPLAY '*******************************'.
DISPLAY 'TIPO NUMERO = 'WS-NUMERO.
DISPLAY 'TIPO STRING = 'WS-STRING.
DISPLAY 'TIPO DOUBLE = 'WS-RESULTADO.
DISPLAY 'NUMERO CARDINAL = 'CARDINAL.
DISPLAY 'NUMERO ENTERO = 'ENTERO.
DISPLAY 'NUMERO DECIMAL = 'DECIMAL.
DISPLAY 'NOMBRE (son espacios) = 'NOMBRE.
DISPLAY 'CABEZA DE REPORTE = 'REPORTE.
DISPLAY "WS-NUM1 : "WS-NUM1.
DISPLAY "WS-NAME : "WS-NAME.
DISPLAY "WS-ID   : "WS-ID.
STOP RUN.
